guix.org
#+TITLE: GNU Guix on Xubuntu, literate and sovereign
#+AUTHOR: Mètsàtron
#+LANGUAGE: en
#+PROPERTY: header-args :mkdirp yes :results silent :comments both

* Intent
A minimal, sovereign Guix install on a Debian-family host, managed from this repo.
We keep privileged steps explicit, package state declarative, and paths inside overlays.
Nothing in here overwrites your shell files directly, it only adds small blocks that tangle into your existing exports files.

* Layout
- Guix channels, profiles, manifests under =all/.config/guix/=
- Helper scripts under =all/.local/bin/=
- Shell exports for PATH added in tiny, self-contained blocks that tangle into =all/.bash_exports= and =all/.zsh_exports=
- No files removed, only appended sections with clear sentinels
  

* One-time system bootstrap
Only run once on this machine. This mirrors the upstream manual for a foreign distro install.

#+BEGIN_SRC bash :tangle no
# 0) Prereqs
sudo apt update
sudo apt install -y build-essential git curl xz-utils bzip2

# 1) Download official installer, verify, run
cd /tmp
rm -f guix-install.sh guix-install.sh.sig

# Follow redirects and fail if not 200
curl -fL -o guix-install.sh 'https://git.savannah.gnu.org/cgit/guix.git/plain/etc/guix-install.sh'
# Quick sanity check
head -n 3 guix-install.sh
# Expect to see: #!/bin/sh on the first line
chmod +x guix-install.sh
# Optional: verify PGP signature if you added Guix keys
# Run the installer
sudo ./guix-install.sh

# 2) Authorize substitute servers, improves build time
# ci.guix.gnu.org should be present after installer, we add bordeaux as well if available
if [ -r /usr/share/guix/bordeaux.guix.gnu.org.pub ]; then
  sudo guix archive --authorize < /usr/share/guix/bordeaux.guix.gnu.org.pub
fi

# 3) Enable and start the daemon
sudo systemctl enable --now guix-daemon
systemctl status guix-daemon --no-pager
#+END_SRC

If the installer complains about guixbuild users, re-run it or create them with =addgroup guixbuild= and =adduser --system= 10 workers linked to that group, which the installer usually handles.

* Channels, manifests, profiles
** Channel pin, reproducible by time-machine if desired
Tangling target: =all/.config/guix/channels.scm=

#+BEGIN_SRC scheme :tangle all/.config/guix/channels.scm
;; Guix channels for Mètsàtron (authenticated)
(list
  (channel
    (name 'guix)
    (url "https://git.savannah.gnu.org/git/guix.git")
    (introduction
      (make-channel-introduction
        "9edb3f66fd807b096b48283debdcddccfea34bad"
        (openpgp-fingerprint
         "BBB0 2DDF 2A54 27B3 78B2 6E33 4B04 82B6 6299 CBB6")))))
#+END_SRC

** User profile manifests
Tangling target: =all/.config/guix/manifests/dev.scm= and friends.

#+BEGIN_SRC scheme :tangle all/.config/guix/manifests/core.scm
(specifications->manifest
 '(
   "git" "htop" "ripgrep" "fd" "jq" "direnv" "btop"
   "python" "node"
   "glibc-locales"   ; for UTF-8 locales
   "nss-certs"       ; TLS certs for HTTPS
   "emacs"           ; or "emacs-pgtk" if you prefer pgtk
   "emacs-vterm"     ; native vterm module for Emacs
   "libvterm"
   "neovim"
   "lsd" "ranger"
   "python-numpy" "python-sympy" "python-coloredlogs" "python-humanfriendly" "python-send2trash" "python-websockets" "python-unidecode" "python-wheel"
   "moreutils"
   "gimp"
   "appmenu-gtk-module"
   "maak" "guile"
   ))
#+END_SRC

#+BEGIN_SRC scheme :tangle all/.config/guix/manifests/dev.scm
(specifications->manifest
 '(
   "gcc-toolchain"
   "gdb"
   "cmake"
   "pkg-config"
   "meson"
   "ninja"
   "shellcheck"
   "shfmt"
   "bear"
   ))
#+END_SRC

Add more manifests as needed, for example =audio.scm= or =media.scm=. Keep them small and purposeful.

** Profile directories
We keep explicit profile prefixes under =~/.guix-extra-profiles= so nothing bleeds into your main profile unless you choose so.
#+NAME: guix-dirs
#+BEGIN_SRC bash :tangle all/.local/bin/guix-mkdirs :shebang "#!/usr/bin/env bash"
set -euo pipefail
# Add any profiles you plan to use here:
profiles=(core dev)

for name in "${profiles[@]}"; do
  base="$HOME/.guix-extra-profiles/$name"
  mkdir -p "$base"
  echo "Ensured: $base"
done
#+END_SRC

Tangling target: none, just convention used by scripts below:
- =~/.guix-extra-profiles/core=
- =~/.guix-extra-profiles/dev=

* Apply profiles
#+BEGIN_SRC bash :tangle no
# 1) Ensure profile dirs exist
~/.local/bin/guix-mkdirs

# 2) Apply core manifest to named profile
~/.local/bin/guix-profile-apply core "$HOME/.config/guix/manifests/core.scm"

# 3) (Optional) Apply dev manifest too
# ~/.local/bin/guix-profile-apply dev "$HOME/.config/guix/manifests/dev.scm"
#+END_SRC

* Session wiring for Guix profiles
#+BEGIN_SRC bash :tangle linux/.xsessionrc.d/20-guix-core-profile.sh :shebang "#!/usr/bin/env bash"
set -euo pipefail
export GUIX_PROFILE="$HOME/.guix-extra-profiles/core/core"
if [ -r "$GUIX_PROFILE/etc/profile" ]; then
  . "$GUIX_PROFILE/etc/profile"
fi
#+END_SRC

* GTK appmenu env
#+BEGIN_SRC conf :tangle linux/.config/environment.d/20-gtk-appmenu.conf
GTK_MODULES=appmenu-gtk-module
#+END_SRC

* Helper scripts
Tangling target: =all/.local/bin/guix-profile-apply=, =guix-profile-list=, =guix-gc-safe=, =guix-search=

#+BEGIN_SRC bash :tangle all/.local/bin/guix-profile-apply :shebang "#!/usr/bin/env bash"
set -euo pipefail
# Apply a manifest to a named profile under ~/.guix-extra-profiles/<name>
name="${1:-}"
manifest="${2:-}"
if [ -z "$name" ] || [ -z "$manifest" ]; then
  echo "Usage: $(basename "$0") <profile-name> <manifest.scm>" >&2
  exit 1
fi
base="$HOME/.guix-extra-profiles/$name"
mkdir -p "$base"
guix package -m "$manifest" -p "$base/$name"
echo "Profile updated: $base/$name"
echo "To activate in this shell:"
echo "  GUIX_PROFILE=$base/$name; . \"$GUIX_PROFILE/etc/profile\""
#+END_SRC

#+BEGIN_SRC bash :tangle all/.local/bin/guix-profile-list :shebang "#!/usr/bin/env bash"
set -euo pipefail
find "$HOME/.guix-extra-profiles" -maxdepth 2 -type d -name "*-link" 2>/dev/null | sort || true
echo
echo "User generations:"
guix package --list-generations || true
#+END_SRC

#+BEGIN_SRC bash :tangle all/.local/bin/guix-gc-safe :shebang "#!/usr/bin/env bash"
set -euo pipefail
echo "Showing store disk usage:"
guix gc --list-live
echo
echo "Running garbage collection for unused items..."
guix gc
echo "Done."
#+END_SRC

#+BEGIN_SRC bash :tangle all/.local/bin/guix-search :shebang "#!/usr/bin/env bash"
set -euo pipefail
if [ $# -eq 0 ]; then
  echo "Usage: $(basename "$0") <query...>" >&2
  exit 1
fi
guix search "$@"
#+END_SRC

** Neovide → Guix Neovim
- Create a tiny wrapper so Neovide always uses your Guix nvim:
#+BEGIN_SRC bash :tangle linux/.local/bin/neovide-core :shebang "#!/usr/bin/env bash"
set -euo pipefail
NVIM="$HOME/.guix-extra-profiles/core/core/bin/nvim"
res="$(xrandr 2>/dev/null | awk '/\*/{print $1; exit}')"
args=(--neovim-bin="$NVIM")
[ -n "${res:-}" ] && args+=(--size="$res")
exec neovide "${args[@]}" "$@"
#+END_SRC

** AstroNvide → Guix Neovim
- Create a tiny wrapper so Neovide always uses your Guix nvim:
#+BEGIN_SRC bash :tangle linux/.local/bin/astronvide :shebang "#!/usr/bin/env bash"
set -euo pipefail
NVIM="$HOME/.guix-extra-profiles/core/core/bin/nvim"
res="$(xrandr 2>/dev/null | awk '/\*/{print $1; exit}')"
export NVIM_APPNAME=astronvim
args=(--neovim-bin="$NVIM")
[ -n "${res:-}" ] && args+=(--size="$res")
exec neovide "${args[@]}" "$@"
#+END_SRC

** Goneovim → Guix Neovim
- Create a tiny wrapper so Neovide always uses your Guix nvim:
#+BEGIN_SRC bash :tangle linux/.local/bin/goneovim-core :shebang "#!/usr/bin/env bash"
set -euo pipefail
NVIM="$HOME/.guix-extra-profiles/core/core/bin/nvim"
if goneovim --help 2>&1 | grep -q -- '--nvimpath'; then
  exec goneovim --nvimpath "$NVIM" --maximized "$@"
else
  exec goneovim --neovim-bin "$NVIM" --maximized "$@"
fi
#+END_SRC

** VSCodium Neovim extension → Guix Neovim
- Set the path in settings.json (and ensure the file exists):
#+BEGIN_SRC json :tangle all/.config/VSCodium/User/settings.json :mkdirp yes :comments no
{
  // --- vscode-neovim wiring ---
  "vscode-neovim.neovimExecutablePaths.linux": "/home/metsatron/.guix-extra-profiles/core/core/bin/nvim",
  "vscode-neovim.neovimInitPath": "/home/metsatron/.dotfiles/all/.config/nvim/vscode/init.lua",
  "extensions.experimental.affinity": { "asvetliakov.vscode-neovim": 1 },

  // optional: prevent host PATH from shadowing Guix
  "terminal.integrated.env.linux": {
    "PATH": "/home/metsatron/.guix-extra-profiles/core/core/bin:${env:PATH}"
  },

  // --- Fonts (editor/terminal/preview) ---
  "editor.fontFamily": "'SF Mono','SFMono Nerd Font','JetBrainsMono Nerd Font',Menlo,Monaco,'Courier New',monospace",
  "editor.fontLigatures": true,
  "terminal.integrated.fontFamily": "'SFMono Nerd Font Mono','SF Mono','SFMono Nerd Font',monospace",
  "markdown.preview.fontFamily": "'SF Pro Text','SF Pro Display','San Francisco',-apple-system,system-ui,sans-serif",
  "notebook.output.fontFamily": "'SF Pro Text','San Francisco',-apple-system,system-ui,sans-serif",
  "workbench.fontAliasing": "antialiased",
  "workbench.colorTheme": "Default Dark+",
  "yaml.schemas": {
    "file:///home/metsatron/.vscode-oss/extensions/continue.continue-1.0.23-linux-x64/config-yaml-schema.json": [
      ".continue/**/*.yaml"
    ]
  },
  "explorer.confirmDragAndDrop": false,
  "explorer.confirmDelete": false,
  "workbench.iconTheme": "se98",
  "workbench.productIconTheme": "Tabler",
  "terminal.integrated.inheritEnv": false,
  "workbench.activityBar.location": "top",
  "vscode-neovim.compositeKeys": {}
}
#+END_SRC

* Daily use, cheat-sheet
- Update channels then upgrade user profiles
  #+BEGIN_SRC bash :tangle no
  guix pull
  make guix-core guix-dev
  # Activate a profile in your current shell if you want its tools
  export GUIX_PROFILE="$HOME/.guix-extra-profiles/core/core"
  . "$GUIX_PROFILE/etc/profile"
  #+END_SRC
- Search packages
  #+BEGIN_SRC bash :tangle no
  guix-search neovim
  #+END_SRC
- Roll back a profile
  #+BEGIN_SRC bash :tangle no
  guix package -p "$HOME/.guix-extra-profiles/core/core" --roll-back
  #+END_SRC
- List user generations and extra profiles
  #+BEGIN_SRC bash :tangle no
  guix-profile-list
  #+END_SRC
- Collect garbage safely
  #+BEGIN_SRC bash :tangle no
  guix-gc-safe
  #+END_SRC

* Notes
- Guix Home is intentionally not enabled here, since you use literate dotfiles as the source of truth. We keep Guix focused on packages and profiles.
- If you ever add =nonguix=, you must explicitly authorize its substitute key. Keep that ritual documented alongside the channels pin.
- Guix can install many tools that overlap with apt, snaps, or flatpaks. Prefer one source per tool to reduce path ambiguity.

* Known issue: Inkscape via Guix (pinned note)
:PROPERTIES:
:CREATED:  [2025-09-24]
:END:

Symptoms (current channel snapshot):
- Runtime complains: libxml2 “no version information available”
- Crash from libxslt: undefined symbol ‘inputPush, version LIBXML2_2.4.30’

Repro snippets:
#+begin_src bash
guix shell --pure inkscape -- inkscape
# or show what binary actually runs:
REAL="$(readlink -f "$(which inkscape)"; true)"; REAL="${REAL%/inkscape}/.inkscape-real"; echo "$REAL"
LD_DEBUG=libs "$REAL" 2>&1 | grep -E 'libxml2|libxslt' | sed -n '1,80p'
#+end_src

Workarounds:
- Prefer distro/Flatpak Inkscape for now.
- Or use a known-good Guix generation *only* for Inkscape:
#+begin_src bash
guix describe --generations
guix time-machine --generation=N -- shell --pure inkscape -- inkscape
#+end_src

We intentionally skip mixed LD_PRELOAD tricks (fragile across ICU/libxml2).
